# vsoStateClear

## Description
```pascal
PROCEDURE vsoStateClear(hObj : HANDLE);
```

```python

def vs.vsoStateClear(hObj):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObj|HANDLE||

## Version
Availability: from Vectorworks 2011
## Category
* Object Events